app/Controllers/DashboardController.php

    public function index(): string
    {
        $respondenModel = new RespondenModel();
        $bobotModel = new BobotKriteriaModel();

        // 1. Total Responden
        $totalResponden = $respondenModel->countAllResults();
        if ($totalResponden == 0) {
            $totalResponden = 1; // Prevent division by zero later if db is empty
        }

        // 2. Usia Statistik
        $builderResponden = $respondenModel->builder();
        $builderResponden->select('AVG(usia) as rata_usia, MIN(usia) as min_usia, MAX(usia) as max_usia');
        $usiaStats = $builderResponden->get()->getRow();

        $rataUsia = $usiaStats->rata_usia ? round($usiaStats->rata_usia) : 0;
        $minUsia = $usiaStats->min_usia ?: 0;
        $maxUsia = $usiaStats->max_usia ?: 0;

        // 3. Distribusi Status
        $builderResponden->select('status, COUNT(status) as total');
        $builderResponden->groupBy('status');
        $statusRaw = $builderResponden->get()->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `responden`
SELECT AVG(usia) as rata_usia, MIN(usia) as min_usia, MAX(usia) as max_usia
FROM `responden`
SELECT `status`, COUNT(status) as total
FROM `responden`
GROUP BY `status`


        // 5. Dinamis Top 3 ARAS (Menggunakan data survei dan rata-rata bobot)
        $skorModel = new \App\Models\SkorLaptopModel();
        $skorData = $skorModel->findAll();
---
SELECT *
FROM `skor_laptop`

        $alternatives = [];
        foreach ($skorData as $skor) {
            // Ambil nama responden (sebagai nama alternatif / pilihan laptop)
            $resp = $respondenModel->find($skor['responden_id']);
---
SELECT *
FROM `responden`
WHERE `responden`.`id` = '1'